academy_name = "TOP"
group = "Python413"
my_name = "Егор"
topic = "Frontend"
emotion = "интересно"
teacher = "Владимир"

print(f"""Привет! Меня зовут {my_name}, и я являюсь студентом IT-академии "{academy_name}". Я обучаюсь в группе {group}. На этой неделе у нас закончился блок по {topic}. Было {emotion.upper() + "!!!🤓"} \n 
Мы успели обсудить Fetch API, основы HTML/CSS, JavaScript и библиотеки Bootstrap5, а также применить 
знания на практике. В конце этого блока мы написали экзамен, заданием которого было одно из домашних заданий.  \n 
Интересно, что даст нам следующий блок?🤔 Мы переходим к бэкенду на Python. {teacher} - наш лучший  преподаватель!
Надеюсь, что Python поможет нам реализовать все задуманное!🎉  \n 
Увидимся на занятии!🌞
""")